docs/evidence/01-cascading-failure/problem/k6-baseline.txt

    ✓ responded (any status)
    ✓ not timeout

    HTTP
    http_req_duration....: avg=3.09ms min=1.02ms   med=2.18ms   max=81.76ms  p(90)=4.71ms   p(95)=6.67ms  
    http_req_failed......: 100.00% 3960 out of 3960
    http_reqs............: 3960    65.725977/s

    EXECUTION
    iteration_duration...: avg=304ms  min=301.24ms med=303.17ms max=384.47ms p(90)=305.63ms p(95)=307.55ms
    iterations...........: 3960    65.725977/s
    vus..................: 20      min=20           max=20
    vus_max..............: 20      min=20           max=20

    NETWORK
    data_received........: 689 kB  11 kB/s
    data_sent............: 1.6 MB  27 kB/s



running (1m00.3s), 00/20 VUs, 3960 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 20 VUs  1m0s
time="2026-04-27T13:37:42Z" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"