docs/evidence/01-cascading-failure/problem/k6.txt
    ✗ not timeout
      ↳  99% — ✓ 872 / ✗ 1

    HTTP
    http_req_duration..............: avg=1.12s min=1.25ms  med=2.88ms   max=10s   p(90)=4.47s p(95)=5.26s
      { expected_response:true }...: avg=4.58s min=2.41s   med=4.43s    max=8.52s p(90)=5.73s p(95)=6.37s
    http_req_failed................: 82.58% 721 out of 873
    http_reqs......................: 873    13.46423/s

    EXECUTION
    iteration_duration.............: avg=1.43s min=301.8ms med=303.92ms max=10.3s p(90)=4.77s p(95)=5.56s
    iterations.....................: 873    13.46423/s
    vus............................: 1      min=1          max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 271 kB 4.2 kB/s
    data_sent......................: 409 kB 6.3 kB/s



running (1m04.8s), 00/20 VUs, 873 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 20 VUs  1m0s
time="2026-04-27T14:06:20Z" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed' have been crossed"